---
type: IFCExtrusionData
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 11
tags: [revit-api, class]
---

# IFCExtrusionData

`Autodesk.Revit.DB.IFC.IFCExtrusionData` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCExtrusionData | 2012 | `public IFCExtrusionData ()` |
| Method | AddLoop | 2012 | `public void AddLoop ( CurveLoop pLoop )` |
| Method | ClearLoops | 2012 | `public void ClearLoops ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetLoops | 2012 | `public IList < CurveLoop > GetLoops ()` |
| Method | IsValid | 2012 | `public bool IsValid ()` |
| Method | RemoveLoopAt | 2012 | `public void RemoveLoopAt ( int index )` |
| Property | ExtrusionBasis | 2012 | `public IFCExtrusionBasis ExtrusionBasis { get ; set ; }` |
| Property | ExtrusionDirection | 2012 | `public XYZ ExtrusionDirection { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ScaledExtrusionLength | 2012 | `public double ScaledExtrusionLength { get ; set ; }` |